Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/include/pio/pic32ck1025gc00100.h
#define PIN_PD09G_TCC2_WO4                         _UINT32_(105)
#define MUX_PD09G_TCC2_WO4                         _UINT32_(6) 
#define PINMUX_PD09G_TCC2_WO4                      ((PIN_PD09G_TCC2_WO4 << 16) | MUX_PD09G_TCC2_WO4)
#define PORT_PD09G_TCC2_WO4                        (_UINT32_(1) << 9)

#define PIN_PD06F_TCC2_WO4                         _UINT32_(102)
#define MUX_PD06F_TCC2_WO4                         _UINT32_(5) 
#define PINMUX_PD06F_TCC2_WO4                      ((PIN_PD06F_TCC2_WO4 << 16) | MUX_PD06F_TCC2_WO4)
#define PORT_PD06F_TCC2_WO4                        (_UINT32_(1) << 6)

#define PIN_PD10G_TCC2_WO5                         _UINT32_(106)
#define MUX_PD10G_TCC2_WO5                         _UINT32_(6) 
#define PINMUX_PD10G_TCC2_WO5                      ((PIN_PD10G_TCC2_WO5 << 16) | MUX_PD10G_TCC2_WO5)
#define PORT_PD10G_TCC2_WO5                        (_UINT32_(1) << 10)

#define PIN_PD07F_TCC2_WO5                         _UINT32_(103)
#define MUX_PD07F_TCC2_WO5                         _UINT32_(5) 
#define PINMUX_PD07F_TCC2_WO5                      ((PIN_PD07F_TCC2_WO5 << 16) | MUX_PD07F_TCC2_WO5)
#define PORT_PD07F_TCC2_WO5                        (_UINT32_(1) << 7)

#define PIN_PD11G_TCC2_WO6                         _UINT32_(107)
#define MUX_PD11G_TCC2_WO6                         _UINT32_(6) 
#define PINMUX_PD11G_TCC2_WO6                      ((PIN_PD11G_TCC2_WO6 << 16) | MUX_PD11G_TCC2_WO6)
#define PORT_PD11G_TCC2_WO6                        (_UINT32_(1) << 11)

#define PIN_PD12G_TCC2_WO7                         _UINT32_(108)
#define MUX_PD12G_TCC2_WO7                         _UINT32_(6) 
#define PINMUX_PD12G_TCC2_WO7                      ((PIN_PD12G_TCC2_WO7 << 16) | MUX_PD12G_TCC2_WO7)
#define PORT_PD12G_TCC2_WO7                        (_UINT32_(1) << 12)

/* ========== PORT definition for TCC3 peripheral ========== */
#define PIN_PA09G_TCC3_WO0                         _UINT32_(9) 
#define MUX_PA09G_TCC3_WO0                         _UINT32_(6) 
#define PINMUX_PA09G_TCC3_WO0                      ((PIN_PA09G_TCC3_WO0 << 16) | MUX_PA09G_TCC3_WO0)
#define PORT_PA09G_TCC3_WO0                        (_UINT32_(1) << 9)

#define PIN_PA04F_TCC3_WO0                         _UINT32_(4) 
#define MUX_PA04F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PA04F_TCC3_WO0                      ((PIN_PA04F_TCC3_WO0 << 16) | MUX_PA04F_TCC3_WO0)
#define PORT_PA04F_TCC3_WO0                        (_UINT32_(1) << 4)

#define PIN_PA10G_TCC3_WO1                         _UINT32_(10)
#define MUX_PA10G_TCC3_WO1                         _UINT32_(6) 
#define PINMUX_PA10G_TCC3_WO1                      ((PIN_PA10G_TCC3_WO1 << 16) | MUX_PA10G_TCC3_WO1)
#define PORT_PA10G_TCC3_WO1                        (_UINT32_(1) << 10)

#define PIN_PA05F_TCC3_WO1                         _UINT32_(5) 
#define MUX_PA05F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PA05F_TCC3_WO1                      ((PIN_PA05F_TCC3_WO1 << 16) | MUX_PA05F_TCC3_WO1)
#define PORT_PA05F_TCC3_WO1                        (_UINT32_(1) << 5)

#define PIN_PA11G_TCC3_WO2                         _UINT32_(11)
#define MUX_PA11G_TCC3_WO2                         _UINT32_(6) 
#define PINMUX_PA11G_TCC3_WO2                      ((PIN_PA11G_TCC3_WO2 << 16) | MUX_PA11G_TCC3_WO2)
#define PORT_PA11G_TCC3_WO2                        (_UINT32_(1) << 11)

#define PIN_PA06F_TCC3_WO2                         _UINT32_(6) 
#define MUX_PA06F_TCC3_WO2                         _UINT32_(5) 
#define PINMUX_PA06F_TCC3_WO2                      ((PIN_PA06F_TCC3_WO2 << 16) | MUX_PA06F_TCC3_WO2)
#define PORT_PA06F_TCC3_WO2                        (_UINT32_(1) << 6)

#define PIN_PA12G_TCC3_WO3                         _UINT32_(12)
#define MUX_PA12G_TCC3_WO3                         _UINT32_(6) 
#define PINMUX_PA12G_TCC3_WO3                      ((PIN_PA12G_TCC3_WO3 << 16) | MUX_PA12G_TCC3_WO3)
#define PORT_PA12G_TCC3_WO3                        (_UINT32_(1) << 12)

#define PIN_PA07F_TCC3_WO3                         _UINT32_(7) 
#define MUX_PA07F_TCC3_WO3                         _UINT32_(5) 
#define PINMUX_PA07F_TCC3_WO3                      ((PIN_PA07F_TCC3_WO3 << 16) | MUX_PA07F_TCC3_WO3)
#define PORT_PA07F_TCC3_WO3                        (_UINT32_(1) << 7)

#define PIN_PB00G_TCC3_WO4                         _UINT32_(32)
#define MUX_PB00G_TCC3_WO4                         _UINT32_(6) 
#define PINMUX_PB00G_TCC3_WO4                      ((PIN_PB00G_TCC3_WO4 << 16) | MUX_PB00G_TCC3_WO4)
#define PORT_PB00G_TCC3_WO4                        (_UINT32_(1) << 0)

#define PIN_PA08F_TCC3_WO4                         _UINT32_(8) 
#define MUX_PA08F_TCC3_WO4                         _UINT32_(5) 
#define PINMUX_PA08F_TCC3_WO4                      ((PIN_PA08F_TCC3_WO4 << 16) | MUX_PA08F_TCC3_WO4)
#define PORT_PA08F_TCC3_WO4                        (_UINT32_(1) << 8)

#define PIN_PB01G_TCC3_WO5                         _UINT32_(33)
#define MUX_PB01G_TCC3_WO5                         _UINT32_(6) 
#define PINMUX_PB01G_TCC3_WO5                      ((PIN_PB01G_TCC3_WO5 << 16) | MUX_PB01G_TCC3_WO5)
#define PORT_PB01G_TCC3_WO5                        (_UINT32_(1) << 1)

#define PIN_PA18F_TCC3_WO5                         _UINT32_(18)
#define MUX_PA18F_TCC3_WO5                         _UINT32_(5) 
#define PINMUX_PA18F_TCC3_WO5                      ((PIN_PA18F_TCC3_WO5 << 16) | MUX_PA18F_TCC3_WO5)
#define PORT_PA18F_TCC3_WO5                        (_UINT32_(1) << 18)

#define PIN_PB11G_TCC3_WO6                         _UINT32_(43)
#define MUX_PB11G_TCC3_WO6                         _UINT32_(6) 
#define PINMUX_PB11G_TCC3_WO6                      ((PIN_PB11G_TCC3_WO6 << 16) | MUX_PB11G_TCC3_WO6)
#define PORT_PB11G_TCC3_WO6                        (_UINT32_(1) << 11)

#define PIN_PB12G_TCC3_WO7                         _UINT32_(44)
#define MUX_PB12G_TCC3_WO7                         _UINT32_(6) 
#define PINMUX_PB12G_TCC3_WO7                      ((PIN_PB12G_TCC3_WO7 << 16) | MUX_PB12G_TCC3_WO7)
#define PORT_PB12G_TCC3_WO7                        (_UINT32_(1) << 12)

#define PIN_PA19F_TCC3_WO7                         _UINT32_(19)
#define MUX_PA19F_TCC3_WO7                         _UINT32_(5) 
#define PINMUX_PA19F_TCC3_WO7                      ((PIN_PA19F_TCC3_WO7 << 16) | MUX_PA19F_TCC3_WO7)
#define PORT_PA19F_TCC3_WO7                        (_UINT32_(1) << 19)

